// // 1.	Парність числа
// // Як перевірити, що число парне?
// function parne(n: number) {
//     return n % 2 === 0;
// }

// console.log(parne(2));
// console.log(parne(3));

// // 2.	Реверс рядка

// // Напиши алгоритм, який перевертає рядок "hello" → "olleh".
// const str = 'olleh';
// console.log(str.split('').reverse().join(''));

// // 3.	Паліндром
// // Як перевірити, чи є слово паліндромом? (наприклад, "level" → так, "hello" → ні).
// const palindrom = 'revel';
// const pal = palindrom.split('').reverse().join('');
// if (palindrom === pal) {
//     console.log('Так');
// } else {
//     console.log('Ні');
// }

// // 4.	Факторіал
// // Знайди факторіал числа (5! = 5×4×3×2×1).
// function factorial(n: number) {
//     let summery = 1;
//     for (let i = 1; i <= n; i++) {
//         summery *= i;
//     }
//     return summery;
// }
// console.log(factorial(5));

// // 5.	Фібоначчі
// // Згенеруй перші 10 чисел ряду Фібоначчі.

// // 6.	Унікальні символи
// // Перевір, чи в рядку всі символи унікальні (наприклад, "abc" → true, "aba" → false).

// // 7.	Підрахунок голосних
// // Напиши функцію, яка рахує кількість голосних у рядку "automation" → 5.

// // 8.	Максимальне число в масиві
// // Знайди найбільше число в масиві [1, 5, 7, 2, 10, 3].
// const ar = [1, 5, 7, 2, 10, 3];
// console.log(
//     ar
//         .sort((a, b) => a - b)
//         .reverse()
//         .shift(),
// );

// // 9.	Сума чисел у масиві
// // Обчисли суму елементів [2, 4, 6, 8].
// const arr = [2, 4, 6, 8];
// const result = arr.reduce((sum, current) => sum + current, 0);
// console.log(result);

// // 10.	FizzBuzz
// // Виведи числа від 1 до 20, але:
// // – замість чисел, кратних 3, друкуй "Fizz"
// // – замість кратних 5 → "Buzz"
// // – кратні і 3, і 5 → "FizzBuzz".
// // ________________________________________
// // 🟡 Середній / складніший рівень (11–20)
// // 11.	Анаграма
// // Перевір, чи є два рядки анаграмами (наприклад, "listen" і "silent").
// // 12.	Реверс слів у реченні
// // "QA Automation is cool" → "cool is Automation QA".
// // 13.	Longest word
// // Знайди найдовше слово в реченні "I love automation testing".
// // 14.	Remove duplicates
// // Видали дублікати з масиву [1, 2, 2, 3, 4, 4, 5] → [1,2,3,4,5].
// // 15.	Second max number
// // Знайди друге за величиною число в масиві [7, 2, 10, 8] → 8.
// // 16.	Balanced brackets
// // Перевір, чи правильно розставлені дужки:
// // •	"({[]})" → true
// // •	"({[})" → false.
// // 17.	Rotate array
// // Зсунь масив на 2 вправо: [1,2,3,4,5] → [4,5,1,2,3].
// // 18.	Count words
// // Порахуй кількість слів у рядку "Test automation is fun" → 4.
// // 19.	Flatten array
// // "Розгорни" масив: [1, [2, 3], [4, [5]]] → [1,2,3,4,5].
// // 20.	Find missing number
// // В масиві [1, 2, 3, 5, 6] знайди пропущене число → 4.
